In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
private = pd.read_csv('optimizedBusiness.csv')
private.rename(columns = {'Real Value Added by Industry': 'Real Value Added by Industry (millions)', 
                          'Real Gross Output by Industry': 'Real Gross Output by Industry (millions)',
                          'Employment ': 'Employment (thousands)',
                          'Compensation': 'Compensation (millions)'}, inplace= True)

private.head()

,Year,Real Value Added by Industry (millions),Real Gross Output by Industry (millions),Employment (thousands),Compensation (millions)
0,2012,"79,861",151467,433,44438
1,2013,89170,159229,432,45211
2,2014,90495,164508,426,45941
3,2015,98536,173324,424,48237
4,2016,99506,173764,411,47959

In [21]:
df_sis = pd.read_csv(r"yearly-number-of-objects-launched-into-outer-space.csv", )

df_sis_cleaned = df_sis[df_sis['Entity'] == "United States"]
df_sis_cleaned = df_sis_cleaned[["Year",  "Annual number of objects launched into outer space"]]
numOb = df_sis_cleaned[df_sis_cleaned["Year"].isin(range(2012, 2024))].reset_index(drop=True)
numOb.head()

   Year  Annual number of objects launched into outer space
0  2012                                                 33
1  2013                                                 80
2  2014                                                 95
3  2015                                                104
4  2016                                                105

In [22]:
private['Annual number of objects launched into outer space'] = numOb['Annual number of objects launched into outer space']

In [23]:
private

,Year,Real Value Added by Industry (millions),Real Gross Output by Industry (millions),Employment (thousands),Compensation (millions),Annual number of objects launched into outer space
0,2012,"79,861",151467,433,44438,33
1,2013,89170,159229,432,45211,80
2,2014,90495,164508,426,45941,95
3,2015,98536,173324,424,48237,104
4,2016,99506,173764,411,47959,105
5,2017,98699,175789,399,49104,286
6,2018,95196,172479,387,48686,190
7,2019,96575,172473,390,52606,362
8,2020,92167,163865,365,51661,984
9,2021,85568,156995,351,52655,1232
10,2022,87779,164711,361,54975,1939
11,2023,86351,161677,373,57924,2234